<template>
  <div class="container fixed-container mb-3">
    <div class="form-group text-left">
      <label>เลือกบริการ</label>
      <div class="form">
        <div class="container">
          <div class="row">
            <div
              v-for="(serviceDataType, index) in dataFetch.dataTypes"
              :key="index"
              v-on:click="fetchDate(serviceDataType.type_id)"
              class="col-6 col-lg-3 mt-1"
            >
              <div
                :class="[
                  'col-12 btnType btn-outline-primary',
                  { active: activeBtnType === 'btn' + index }
                ]"
                @click="activeBtnType = 'btn' + index"
              >
                <div class="text-center" style="margin-top: 32px;">
                  <svg
                    v-if="'btn' + index == activeBtnType"
                    width="48"
                    height="48"
                    viewBox="0 0 48 48"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M1.17813 29.9139C1.44097 30.0965 1.71845 30.257 2.00773 30.3939C2.35413 30.5715 2.93413 30.8675 2.97413 31.0747C3.02478 31.3476 2.99217 31.6294 2.88053 31.8835C2.76133 32.1395 2.63573 32.3595 2.52853 32.5499C2.23493 33.0675 1.74453 33.9339 2.48453 34.5379C2.65733 34.6979 2.95573 34.9291 3.22853 35.1379C3.02797 35.4879 2.93712 35.8901 2.96773 36.2923C3.01009 36.6091 3.18185 36.8941 3.44213 37.0795C3.61973 37.2043 3.80933 37.3139 3.99653 37.4195C4.46933 37.6891 4.65413 37.8147 4.71653 38.0651C4.76109 38.3871 4.73377 38.7149 4.63653 39.0251C4.59013 39.2395 4.54373 39.4539 4.51733 39.6651C4.43778 40.3941 4.52758 41.1317 4.77973 41.8203C5.13896 43.0911 6.28811 43.9767 7.60853 44.0003C7.82929 44 8.04942 43.9767 8.26533 43.9307C10.5509 43.3899 12.803 42.7162 15.0101 41.9131C16.8117 42.9699 17.9509 46.1867 18.2477 47.3931C18.3363 47.75 18.6568 48.0005 19.0245 48.0003L39.1045 47.9443C39.359 47.9438 39.5981 47.8223 39.7484 47.617C39.8988 47.4116 39.9425 47.1471 39.8661 46.9043C39.6683 46.3623 39.3956 45.8506 39.0557 45.3843C38.8641 45.1075 38.6909 44.8183 38.5373 44.5187C38.1757 43.7849 37.8737 43.0233 37.6341 42.2411C37.1776 40.6959 36.8612 39.1127 36.6885 37.5107C36.6052 36.7402 36.5905 35.9638 36.6445 35.1907C36.6965 35.1907 36.7461 35.1987 36.7981 35.1987C41.7154 35.1948 46.055 31.9841 47.4969 27.2831C48.9389 22.582 47.1459 17.4902 43.0765 14.7299C42.9447 13.6933 42.7399 12.6673 42.4637 11.6595C41.6509 8.91197 39.9745 6.49944 37.6829 4.77949C35.6861 3.15708 33.4339 1.8773 31.0181 0.992293C30.9953 0.985208 30.972 0.979333 30.9485 0.974693C29.5182 0.332928 27.9683 0.000864865 26.4005 0.000293009C26.2405 0.000293009 26.0861 0.017893 25.9277 0.024293C25.9165 0.024293 25.9077 0.017093 25.8965 0.017093C25.2429 -0.010107 24.6277 -0.00610698 24.0141 0.025093C21.4112 0.205437 18.825 0.576837 16.2765 1.13629C12.6701 1.85629 10.0477 3.11949 8.25813 5.01149C6.84665 6.52248 5.75519 8.30321 5.04933 10.2467C4.76092 11.0826 4.52421 11.9354 4.34053 12.8003L4.26053 13.1371C4.09016 13.7651 3.8606 14.3756 3.57493 14.9603C3.41493 15.3243 3.25013 15.6883 3.10533 16.0675C2.92303 16.4881 2.85089 16.9481 2.89573 17.4043C3.05674 18.121 3.47053 18.7558 4.06133 19.1923C4.45253 19.5515 4.70933 19.8043 4.71253 20.0243C4.68301 20.1459 4.63726 20.2629 4.57653 20.3723C3.61808 22.3901 2.44376 24.298 1.07413 26.0627C0.494931 26.7683 -0.111469 27.5907 0.0157313 28.4139C0.186744 29.0494 0.605464 29.5897 1.17813 29.9139ZM46.4005 24.0003C46.3948 29.2999 42.1001 33.5946 36.8005 33.6003C36.5285 33.6003 36.2613 33.5819 35.9949 33.5595H35.9909H35.9821C33.2933 33.3525 30.8188 32.0136 29.1746 29.8761C27.5303 27.7386 26.8709 25.0034 27.3605 22.3515C28.4044 22.262 29.4304 22.025 30.4077 21.6475C30.4224 22.8219 31.2848 23.8131 32.4458 23.9902C33.6069 24.1672 34.7255 23.4779 35.0894 22.3613C35.4534 21.2446 34.9557 20.0286 33.9133 19.4875C35.4254 18.1217 36.5364 16.3696 37.1269 14.4195C42.2926 14.5973 46.3911 18.8315 46.4005 24.0003ZM26.4005 1.60029C31.7025 1.60029 36.0005 5.89836 36.0005 11.2003C36.0005 16.5022 31.7025 20.8003 26.4005 20.8003C21.0986 20.8003 16.8005 16.5022 16.8005 11.2003C16.8063 5.90074 21.101 1.60602 26.4005 1.60029ZM33.6005 21.6003C33.6005 22.0421 33.2424 22.4003 32.8005 22.4003C32.3587 22.4003 32.0005 22.0421 32.0005 21.6003C32.0005 21.1585 32.3587 20.8003 32.8005 20.8003C33.2424 20.8003 33.6005 21.1585 33.6005 21.6003ZM40.9269 12.0979C41.0749 12.6195 41.1997 13.1763 41.3093 13.7555C40.0945 13.2218 38.794 12.9097 37.4693 12.8339C37.8661 10.3166 37.366 7.74002 36.0565 5.55389C36.2701 5.71389 36.4845 5.87389 36.6965 6.04029C38.7288 7.54484 40.2142 9.67183 40.9269 12.0979ZM2.33973 27.0403C3.77154 25.1964 4.99899 23.2026 6.00053 21.0939C6.18851 20.7638 6.29441 20.3934 6.30933 20.0139C6.22741 19.2095 5.80112 18.4801 5.14053 18.0139C4.82053 17.7171 4.51173 17.4371 4.47653 17.1779C4.48269 16.9888 4.52477 16.8025 4.60053 16.6291C4.73093 16.2867 4.88133 15.9507 5.03253 15.6147C5.36084 14.938 5.62312 14.2313 5.81573 13.5043L5.89573 13.1643C6.06562 12.3636 6.28443 11.5742 6.55093 10.8003C7.18181 9.06005 8.15819 7.46541 9.42133 6.11229C10.9525 4.49149 13.3605 3.34669 16.5925 2.70429C17.6213 2.49469 18.7429 2.28109 19.9021 2.09549C16.0351 4.84523 14.3252 9.73661 15.6369 14.2967C16.9487 18.8568 20.9963 22.092 25.7333 22.3667C25.6498 22.9073 25.6054 23.4533 25.6005 24.0003C25.61 29.4973 29.6049 34.176 35.0325 35.0467C34.9749 35.9328 34.9982 36.8224 35.1021 37.7043C35.2861 39.4032 35.623 41.082 36.1085 42.7203C36.3715 43.5806 36.7035 44.4183 37.1013 45.2251C37.2838 45.5876 37.4913 45.9369 37.7221 46.2707C37.7397 46.2971 37.7573 46.3235 37.7749 46.3507L19.6293 46.4003C19.0979 44.5027 18.1341 42.754 16.8133 41.2915L17.5645 41.0291C18.0861 40.8475 18.4797 40.7091 18.6845 40.6443C22.1125 39.5619 23.8261 38.0043 23.7797 36.0043C23.773 35.7185 23.6143 35.458 23.3635 35.3209C23.1126 35.1838 22.8076 35.191 22.5635 35.3397C22.3193 35.4884 22.173 35.7561 22.1797 36.0419C22.1989 36.8651 21.5245 38.0659 18.1973 39.1171C17.9837 39.1859 17.5781 39.3275 17.0389 39.5171C16.4397 39.7267 15.6733 39.9971 14.8253 40.2827C12.574 41.1081 10.2769 41.8026 7.94533 42.3627C7.19834 42.5059 6.4709 42.0361 6.29413 41.2963C6.12366 40.8411 6.05937 40.3529 6.10613 39.8691C6.12773 39.7011 6.16533 39.5339 6.20213 39.3667C6.36485 38.8135 6.38848 38.2288 6.27093 37.6643C6.03802 36.9304 5.49802 36.3338 4.79093 36.0291C4.73493 35.9979 4.67973 35.9659 4.62453 35.9339C4.71107 35.7592 4.8145 35.5933 4.93333 35.4387C5.06719 35.2686 5.12641 35.0515 5.09747 34.837C5.06853 34.6225 4.95389 34.4288 4.77973 34.3003C4.58773 34.1587 4.13493 33.8203 3.80373 33.5531C3.84213 33.4835 3.88373 33.4067 3.92373 33.3379C4.04933 33.1171 4.19333 32.8579 4.33253 32.5651C4.58609 32.0044 4.66068 31.3793 4.54613 30.7747C4.35413 29.7979 3.41893 29.3195 2.73573 28.9707C2.50551 28.8619 2.28498 28.7337 2.07653 28.5875C1.90509 28.473 1.74443 28.3431 1.59653 28.1995C1.60053 28.0803 1.73013 27.7851 2.33973 27.0403Z"
                      fill="white"
                    />
                  </svg>
                  <svg
                    v-if="'btn' + index != activeBtnType"
                    width="48"
                    height="48"
                    viewBox="0 0 47 46"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M2.02907 28.4742C2.27635 28.6466 2.53739 28.7983 2.80955 28.9275C3.13544 29.0953 3.6811 29.3748 3.71873 29.5705C3.76638 29.8282 3.7357 30.0944 3.63067 30.3344C3.51853 30.5761 3.40037 30.7839 3.29951 30.9637C3.0233 31.4526 2.56193 32.2709 3.25812 32.8413C3.42069 32.9924 3.70142 33.2108 3.95807 33.408C3.76938 33.7385 3.6839 34.1183 3.71271 34.4982C3.75256 34.7974 3.91415 35.0666 4.15902 35.2417C4.3261 35.3596 4.50448 35.4631 4.68059 35.5628C5.1254 35.8174 5.29926 35.9361 5.35796 36.1725C5.39988 36.4766 5.37417 36.7863 5.2827 37.0792C5.23904 37.2817 5.19539 37.4842 5.17056 37.6837C5.09571 38.3722 5.18019 39.0687 5.41742 39.7191C5.75537 40.9194 6.83649 41.7557 8.07872 41.778C8.28641 41.7777 8.4935 41.7557 8.69663 41.7123C10.8469 41.2015 12.9656 40.5652 15.0421 39.8068C16.737 40.8049 17.8087 43.8429 18.088 44.9823C18.1713 45.3194 18.4728 45.556 18.8188 45.5558L37.7098 45.5029C37.9492 45.5024 38.1741 45.3877 38.3156 45.1937C38.457 44.9998 38.4982 44.7499 38.4263 44.5207C38.2403 44.0088 37.9836 43.5255 37.6639 43.0851C37.4837 42.8237 37.3207 42.5506 37.1762 42.2676C36.836 41.5746 36.5519 40.8553 36.3265 40.1165C35.897 38.6572 35.5993 37.1619 35.4369 35.6489C35.3585 34.9212 35.3446 34.188 35.3955 33.4578C35.4444 33.4578 35.4911 33.4654 35.54 33.4654C40.1661 33.4617 44.2487 30.4294 45.6053 25.9895C46.9619 21.5496 45.2751 16.7407 41.4466 14.1337C41.3226 13.1547 41.1299 12.1857 40.8701 11.2339C40.1055 8.63903 38.5283 6.36053 36.3724 4.73614C34.4938 3.20386 32.375 1.99518 30.1022 1.15934C30.0807 1.15265 30.0589 1.1471 30.0368 1.14271C28.6911 0.536603 27.233 0.222988 25.758 0.222448C25.6075 0.222448 25.4623 0.23907 25.3132 0.245115C25.3027 0.245115 25.2944 0.238315 25.2839 0.238315C24.669 0.212626 24.0902 0.216404 23.5129 0.24587C21.0641 0.416195 18.6311 0.766962 16.2335 1.29534C12.8406 1.97534 10.3735 3.16836 8.68986 4.95525C7.36195 6.38229 6.33512 8.06409 5.67106 9.8996C5.39972 10.689 5.17702 11.4945 5.00422 12.3113L4.92896 12.6294C4.76868 13.2226 4.55271 13.7991 4.28396 14.3513C4.13343 14.6951 3.97839 15.0389 3.84216 15.397C3.67065 15.7942 3.60278 16.2287 3.64497 16.6596C3.79645 17.3365 4.18574 17.9359 4.74156 18.3482C5.10959 18.6875 5.35119 18.9262 5.3542 19.134C5.32642 19.2488 5.28338 19.3594 5.22625 19.4627C4.32455 21.3683 3.21976 23.1703 1.93123 24.8369C1.38632 25.5033 0.815828 26.2801 0.935497 27.0575C1.09638 27.6577 1.49031 28.168 2.02907 28.4742ZM44.5738 22.8891C44.5684 27.8943 40.528 31.9504 35.5423 31.9558C35.2864 31.9558 35.035 31.9384 34.7844 31.9173H34.7806H34.7723C32.2427 31.7217 29.9147 30.4572 28.3678 28.4385C26.8209 26.4197 26.2006 23.8365 26.6612 21.3319C27.6433 21.2474 28.6085 21.0236 29.528 20.667C29.5417 21.7762 30.3531 22.7124 31.4454 22.8795C32.5377 23.0467 33.59 22.3958 33.9324 21.3412C34.2748 20.2865 33.8067 19.1381 32.826 18.627C34.2485 17.3372 35.2938 15.6823 35.8493 13.8406C40.7092 14.0085 44.565 18.0075 44.5738 22.8891ZM25.758 1.73356C30.746 1.73356 34.7896 5.79285 34.7896 10.8002C34.7896 15.8076 30.746 19.8669 25.758 19.8669C20.77 19.8669 16.7265 15.8076 16.7265 10.8002C16.7319 5.79509 20.7723 1.73897 25.758 1.73356ZM32.5317 20.6225C32.5317 21.0397 32.1948 21.378 31.7791 21.378C31.3634 21.378 31.0265 21.0397 31.0265 20.6225C31.0265 20.2052 31.3634 19.8669 31.7791 19.8669C32.1948 19.8669 32.5317 20.2052 32.5317 20.6225ZM39.4243 11.648C39.5636 12.1406 39.681 12.6665 39.7841 13.2135C38.6412 12.7095 37.4177 12.4147 36.1715 12.3431C36.5447 9.96567 36.0743 7.53219 34.8423 5.46752C35.0433 5.61863 35.245 5.76974 35.4444 5.92689C37.3563 7.34786 38.7538 9.35668 39.4243 11.648ZM3.12189 25.7602C4.46892 24.0188 5.6237 22.1358 6.56593 20.1442C6.74278 19.8325 6.84242 19.4826 6.85645 19.1242C6.77938 18.3645 6.37833 17.6756 5.75686 17.2353C5.4558 16.955 5.16529 16.6905 5.13217 16.4457C5.13796 16.2671 5.17755 16.0912 5.24883 15.9274C5.37151 15.6041 5.513 15.2867 5.65525 14.9694C5.96411 14.3303 6.21087 13.6628 6.39208 12.9762L6.46734 12.6551C6.62717 11.8989 6.83302 11.1533 7.08374 10.4225C7.67726 8.77889 8.59583 7.27283 9.78419 5.99489C11.2247 4.46414 13.4901 3.38294 16.5308 2.77623C17.4987 2.57827 18.5539 2.37654 19.6444 2.20125C16.0063 4.79822 14.3977 9.41786 15.6318 13.7246C16.8658 18.0314 20.6738 21.0869 25.1303 21.3463C25.0518 21.8569 25.01 22.3725 25.0054 22.8891C25.0143 28.0807 28.7727 32.4995 33.8789 33.3218C33.8247 34.1587 33.8466 34.9989 33.9444 35.8318C34.1175 37.4363 34.4344 39.0218 34.8912 40.5691C35.1386 41.3816 35.451 42.1727 35.8252 42.9348C35.9969 43.2771 36.1921 43.6071 36.4093 43.9223C36.4258 43.9472 36.4424 43.9721 36.459 43.9978L19.3878 44.0447C18.8878 42.2525 17.981 40.601 16.7385 39.2197L17.4452 38.9719C17.9359 38.8004 18.3062 38.6697 18.4989 38.6085C21.7239 37.5862 23.3361 36.1151 23.2924 34.2262C23.2861 33.9563 23.1368 33.7103 22.9008 33.5808C22.6648 33.4513 22.3779 33.4581 22.1482 33.5985C21.9184 33.739 21.7808 33.9918 21.7872 34.2617C21.8052 35.0392 21.1708 36.1733 18.0406 37.1661C17.8396 37.2311 17.458 37.3648 16.9507 37.5439C16.387 37.7418 15.666 37.9972 14.8682 38.2669C12.7502 39.0465 10.5891 39.7024 8.39558 40.2314C7.69282 40.3666 7.00845 39.9229 6.84215 39.2242C6.68178 38.7943 6.62128 38.3333 6.66528 37.8763C6.6856 37.7177 6.72098 37.5597 6.7556 37.4018C6.90868 36.8794 6.93091 36.3271 6.82032 35.794C6.6012 35.1009 6.09317 34.5374 5.42796 34.2497C5.37527 34.2202 5.32334 34.19 5.27141 34.1597C5.35283 33.9947 5.45013 33.8381 5.56192 33.6921C5.68786 33.5314 5.74357 33.3264 5.71634 33.1238C5.68911 32.9212 5.58126 32.7383 5.41742 32.6169C5.23679 32.4832 4.8108 32.1636 4.49921 31.9112C4.53533 31.8455 4.57447 31.7729 4.6121 31.708C4.73027 31.4994 4.86574 31.2546 4.9967 30.9781C5.23525 30.4486 5.30541 29.8581 5.19765 29.2872C5.01702 28.3646 4.13719 27.9128 3.49444 27.5834C3.27785 27.4807 3.07038 27.3596 2.87428 27.2215C2.71299 27.1133 2.56184 26.9907 2.4227 26.855C2.42646 26.7425 2.54839 26.4637 3.12189 25.7602Z"
                      fill="#99A3FF"
                    />
                  </svg>
                  <p
                    v-if="'btn' + index == activeBtnType"
                    style="color: #FFFFFF"
                  >
                    {{ serviceDataType.type_name }}
                  </p>
                  <p
                    v-if="'btn' + index != activeBtnType"
                    style="color: #555555"
                  >
                    {{ serviceDataType.type_name }}
                  </p>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div class="row">
      <div class="form-group text-left w-100">
        <div class="col-12">
          <label for="selectDate">เลือกวัน</label>
        </div>
        <div class="col-12">
          <select
            class="form-control"
            v-model="selectedDate"
            @change="fetchTime()"
            id="selectDate"
            style="width:100%;"
          >
            <!-- <option :value="null" disabled selected="selected"
              >กรุณาเลือกวัน</option -->
            >
            <option
              v-for="(dataDate, index) in dataFetch.dataDates"
              :key="index"
              :value="dataDate"
              :selected="index == 0 ? 'selected' : ''"
            >
              {{
                index == 0
                  ? ((selectFirstDate = dataDate.date),
                    (dataShow.date = dataDate.date))
                  : dataDate.date
              }}</option
            >
          </select>
        </div>
      </div>
    </div>
    <div class="row">
      <div class="form-group">
        <div class="col-12">
          <label
            for="exampleInputPassword1"
            class="d-flex justify-content-start"
            >เลือกเวลา</label
          >
        </div>
        <div class="col-12">
          <div
            v-if="this.dataDate == null"
            class="alert alert-warning"
            role="alert"
          >
            กรุณาเลือกวันให้เรียบร้อยก่อน
          </div>
          <div class="container" v-if="this.dataDate != null">
            <div class="row">
              <div
                v-for="(timeLoop, index) in dataFetch.dataTimes"
                :key="index"
                class="col-xs-3 text-center"
              >
                <button
                  href="#"
                  :class="[
                    timeLoop.status == 0
                      ? 'btn btn-outline-primary mr-2 mb-2 btnTime'
                      : 'btn btn-secondary mr-2 mb-2 disable btnTime btnDisabled',

                    { active: activeBtnTime === 'btn' + index }
                  ]"
                  @click="
                    [
                      timeLoop.status == 0
                        ? onChangeTime(
                            timeLoop.booking_id,
                            timeLoop.time_in.slice(0, 5)
                          )
                        : '',
                      (activeBtnTime = 'btn' + index)
                    ]
                  "
                  :disabled="timeLoop.status == 1 ? true : false"
                >
                  {{ timeLoop.time_in.slice(0, 5) }}
                </button>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>

    <div class="form-group">
      <label for="exampleInputPassword1" class="d-flex justify-content-start"
        >อาการ</label
      >
      <textarea
        rows="3"
        class="form-control"
        v-model="dataPrepareSend.symptom"
        :disabled="activeBtnTime == '' ? true : false"
      ></textarea>
    </div>
    <div class="row" style="text-align: center;">
      <div class="col-12">
        <button
          @click="sendToBackend"
          class="btn btn-primary btnBlock btnConfirm mt-5 fixed-button mb-2"
        >
          Confirm
        </button>
      </div>
    </div>
  </div>
</template>

<script>
import axios from "axios";

export default {
  data() {
    return {
      selectFirstDate: "",
      selectedDate: [],
      dataPrepareSend: {
        booking_id: null,
        user_id: null,
        symptom: null
      },
      dataFetch: {
        dataTypes: null,
        dataDates: null,
        dataTimes: null
      },
      dataShow: {
        date: "",
        time: null
      },
      activeBtnType: "btn0",
      activeBtnTime: "",
      dataDate: 1,
      oldTypeService: null
    };
  },
  methods: {
    clearData() {
      this.dataPrepareSend.booking_id = null;
      this.dataShow.date = "";
      this.dataShow.time = null;
    },
    async fetchDate(type_id) {
      this.clearData();
      this.$swal({
        title: "กรุณารอสักครู่",
        allowEscapeKey: false,
        allowOutsideClick: false,
        onOpen: () => {
          this.$swal.showLoading();
        }
      });

      console.log("oldservice = " + this.oldTypeService);
      if (this.oldTypeService !== type_id) {
        this.activeBtnTime = "";
        // this.dataPrepareSend.symptom = null;
        // this.dataFetch.dataTimes = null;
        // this.selectedDate = null;
        await axios
          .get("http://127.0.0.1:3333/ServiceDate/" + type_id)
          .then(res => {
            this.dataFetch.dataDates = res.data;
            console.log(this.dataFetch.dataDates);
            this.oldTypeService = type_id;
          });
      }

      //ทุกครั้งทีมีการกดให้ไปดึงวันที่แรกของช่องเลือกวัน
      await axios
        .get(
          "http://127.0.0.1:3333/ServiceTime/" +
            type_id +
            "?time=" +
            this.selectFirstDate
        )
        .then(res => {
          this.dataFetch.dataTimes = res.data;
          console.log(this.dataFetch.dataTimes);

          this.$swal.close();
        });
    },
    async fetchTime(e) {
      this.clearData();

      this.dataShow.date = this.selectedDate.date;
      console.log("----" + this.dataShow.date);
      this.activeBtnTime = "";
      console.log("fetchTime");
      console.log(this.selectedDate);
      await axios
        .get(
          "http://127.0.0.1:3333/ServiceTime/" +
            this.selectedDate.type_id +
            "?time=" +
            this.selectedDate.date
        )
        .then(res => {
          this.dataFetch.dataTimes = res.data;
          console.log(this.dataFetch.dataTimes);

          this.$swal.close();
        });
    },
    onChangeTime(booking_id, time) {
      this.dataPrepareSend.booking_id = booking_id;
      this.dataShow.time = time;
    },
    sendToBackend() {
      if (this.dataPrepareSend.booking_id != null) {
        console.log("Backend----" + this.dataShow.date);
        this.$swal({
          title: "การจอง",
          text: "วันที่:" + this.dataShow.date + " เวลา:" + this.dataShow.time,
          icon: "info",
          showCancelButton: true,
          confirmButtonColor: "#3085d6",
          cancelButtonColor: "#d33",
          confirmButtonText: "Yes",
          cancelButtonText: "Cancel",
          footer: "กรุณามาก่อนเวลา 15 นาที"
        }).then(result => {
          if (result.value) {
            this.$swal({
              title: "กรุณารอสักครู่",
              allowEscapeKey: false,
              allowOutsideClick: false,
              onOpen: () => {
                this.$swal.showLoading();
              }
            });

            axios
              .post("http://127.0.0.1:3333/Booking", {
                booking_id: this.dataPrepareSend.booking_id,
                //Edit user_id เป็นของ user คนนั้นๆ

                user_id: 1,

                symptom: this.dataPrepareSend.symptom
              })
              .then(res => {
                console.log(res.data);

                this.$swal({
                  toast: true,
                  position: "top-end",
                  showConfirmButton: false,
                  timer: 3000,
                  icon: "success",
                  title: "การจองสำเร็จ"
                  // text: "จองสำเร็จ"
                });
                // Set Local Storage

                this.$router.push("Appointment");
              });
            console.log(this.dataPrepareSend);
          }
        });
      } else {
        this.$swal({
          icon: "warning",
          title: "คำเตือน",
          text: "กรุณาเลือกเวลาที่ต้องการจอง"
        });
      }
    }

    // onChangeDate(date, dateString) {
    //   this.dataDate = dateString;
    //   console.log(this.dataDate);
    // },
    // sendToBackend() {
    //   if (this.dataDate != null && this.time != null) {
    //     const data = {
    //       type: "จิตแพทย์",
    //       date: this.dataDate,
    //       time: this.time,
    //       symptom: this.symptom
    //     };
    //     console.log(data);
    //     if (localStorage.getItem("appointment")) {
    //       try {
    //         this.appointment = JSON.parse(localStorage.getItem("appointment"));
    //       } catch (e) {
    //         console.log(e);
    //       }
    //     }
    //     this.appointment.push(data);
    //     localStorage.setItem("appointment", JSON.stringify(this.appointment));
    //     this.$router.push("Appointment");
    //   } else {
    //     alert("กรอกข้อมูลให้ครบ");
    //   }
    // }
  },
  async mounted() {
    // this.$swal.showLoading();
    this.$swal({
      title: "กรุณารอสักครู่",
      allowEscapeKey: false,
      allowOutsideClick: false,
      onOpen: () => {
        this.$swal.showLoading();
      }
    });
    await axios.get("http://127.0.0.1:3333/ServiceTypes").then(res => {
      this.dataFetch.dataTypes = res.data;
    });
    await axios.get("http://127.0.0.1:3333/ServiceDate/" + 1).then(res => {
      this.dataFetch.dataDates = res.data;
    });
    await axios
      .get(
        "http://127.0.0.1:3333/ServiceTime/" +
          1 +
          "?time=" +
          this.selectFirstDate
      )
      .then(res => {
        this.dataFetch.dataTimes = res.data;
        console.log(this.dataFetch.dataTimes);
        this.$swal.close();
      });
  }
};
</script>

<style scoped>
@media (max-width: 776px) {
  .fixed-button {
    width: 100%;
    height: 48px;
  }
}
@media (min-width: 776px) {
  .fixed-button {
    width: 320px;
    text-align: center;
    position: relative;
    height: 48px;
  }
}
@media (min-width: 900px) {
  .fixed-container {
    width: 720px;
  }
}

.btnTime {
  height: 48px;
  width: 72px;
}

.btnType {
  cursor: pointer;
  background-color: #ffffff;
  border: 2px solid #99a3ff;
  border-radius: 8px;
  height: 100%;
}

button {
  border-radius: 8px;
}
.btnConfirm {
  border-radius: 31px;
}
.btnDisabled {
  cursor: default;
}
.btnDisabled:active {
  outline: none;
}
</style>
